test/logs/stress_20260526_224146.log
Log: /home/ubuntu/HTTP-RPC/test/logs/stress_20260526_224146.log

Cookie ready
Test data ready

==============================================
  HTTP-RPC 逐层压测 (v5)
  并发: 20c × 250req = 5000 total
  双 Gateway: gateway-1 + gateway-2
==============================================

=== L0: 阶梯加压 (stepwise ramp-up, 找拐点) ===

  --- 10c × 100req/conn = 1000 total ---
  QPS=35356.93  P50=0         P99=0       

  --- 20c × 100req/conn = 2000 total ---
  QPS=42405.22  P50=0         P99=1       

  --- 50c × 100req/conn = 5000 total ---
  QPS=36830.24  P50=0         P99=1       

  --- 100c × 100req/conn = 10000 total ---
  QPS=34537.07  P50=2         P99=7         ← P99 突增 7.00x，拐点!

  --- 200c × 100req/conn = 20000 total ---
  QPS=31879.11  P50=2         P99=8       
  拐点: 并发=100c, QPS≈36830.24 req/s

=== L1a: 内网直连 gateway-1:8081 (无 TLS) ===
  gateway-1 reachable

=== gateway-1 健康基线 (无鉴权) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-1
Server Port:            8081

Document Path:          /api/health
Document Length:        19 bytes

Concurrency Level:      20
Time taken for tests:   0.206 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4958
Total transferred:      1559454 bytes
HTML transferred:       95000 bytes
Requests per second:    24307.13 [#/sec] (mean)
Time per request:       0.823 [ms] (mean)
Time per request:       0.041 [ms] (mean, across all concurrent requests)
Transfer rate:          7403.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     0    1   0.6      1       4
Waiting:        0    1   0.6      1       4
Total:          0    1   0.6      1       5

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      3
  99%      3
 100%      5 (longest request)
Requests per second:    24307.13 [#/sec] (mean)
  50%      1
  95%      2
  99%      3
 100%      5 (longest request)
  Failed: 0  |  Non-2xx: 

=== gateway-1 Sheet List (Cookie+gRPC) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-1 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-1
Server Port:            8081

Document Path:          /api/sheets
Document Length:        928 bytes

Concurrency Level:      20
Time taken for tests:   12.687 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4960
Total transferred:      6109480 bytes
HTML transferred:       4640000 bytes
Requests per second:    394.10 [#/sec] (mean)
Time per request:       50.749 [ms] (mean)
Time per request:       2.537 [ms] (mean, across all concurrent requests)
Transfer rate:          470.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     7   51  18.4     48     152
Waiting:        7   51  18.4     48     152
Total:          7   51  18.4     48     152

Percentage of the requests served within a certain time (ms)
  50%     48
  66%     55
  75%     60
  80%     64
  90%     74
  95%     85
  98%     99
  99%    111
 100%    152 (longest request)
Requests per second:    394.10 [#/sec] (mean)
  50%     48
  95%     85
  99%    111
 100%    152 (longest request)
  Failed: 0  |  Non-2xx: 

=== L1b: 内网直连 gateway-2:8081 (无 TLS) ===
  gateway-2 reachable

=== gateway-2 健康基线 (无鉴权) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-2 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-2
Server Port:            8081

Document Path:          /api/health
Document Length:        19 bytes

Concurrency Level:      20
Time taken for tests:   0.142 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4954
Total transferred:      1559402 bytes
HTML transferred:       95000 bytes
Requests per second:    35088.21 [#/sec] (mean)
Time per request:       0.570 [ms] (mean)
Time per request:       0.028 [ms] (mean, across all concurrent requests)
Transfer rate:          10686.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    0   0.2      0       2
Waiting:        0    0   0.2      0       2
Total:          0    0   0.2      0       2

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      1
  99%      1
 100%      2 (longest request)
Requests per second:    35088.21 [#/sec] (mean)
  50%      0
  95%      0
  99%      1
 100%      2 (longest request)
  Failed: 0  |  Non-2xx: 

=== gateway-2 Sheet List (Cookie+gRPC) (5000 req × 20c — ab keep-alive) ===
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking gateway-2 (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        gateway-2
Server Port:            8081

Document Path:          /api/sheets
Document Length:        928 bytes

Concurrency Level:      20
Time taken for tests:   12.956 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    4960
Total transferred:      6109480 bytes
HTML transferred:       4640000 bytes
Requests per second:    385.92 [#/sec] (mean)
Time per request:       51.825 [ms] (mean)
Time per request:       2.591 [ms] (mean, across all concurrent requests)
Transfer rate:          460.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1  33.3      0    1055
Processing:     7   51  18.3     48     156
Waiting:        7   51  18.3     48     156
Total:          7   52  38.2     48    1116

Percentage of the requests served within a certain time (ms)
  50%     48
  66%     56
  75%     61
  80%     64
  90%     75
  95%     85
  98%     99
  99%    106
 100%   1116 (longest request)
Requests per second:    385.92 [#/sec] (mean)
  50%     48
  95%     85
  99%    106
 100%   1116 (longest request)
  Failed: 0  |  Non-2xx: 

=== L1d: 内网写入压测 (容器内 curl, 10c 并发创建→获取→更新→删除) ===
  10c 并发 × 5 轮 = 50 次写入循环
  每循环: POST create → GET → PUT update → POST delete
OK_COUNT=50
ERR_COUNT=0
0
ELAPSED_MS=2040
OPS_SEC=98.0
  写入成功率: 50/50
    总耗时: 2040ms 
    写入吞吐: 98.0 ops/s (每 op = 4 次 HTTP 调用) 

=== L2: 本地 nginx TLS (localhost:443 → least_conn → gateway-1/2) ===

[WARN]   nginx api_limit (rate=100r/s burst=50) 可能触发 429 — 压测时建议注释 limit_req
  [健康基线]
Failed requests:        3791
Requests per second:    8233.73 [#/sec] (mean)
  50%      2
  95%      4
  99%      6
 100%     69 (longest request)

  [Sheet List — Cookie+gRPC+Redis 完整链路]
Failed requests:        0
Requests per second:    350.51 [#/sec] (mean)
  50%     55
  95%     88
  99%    106
 100%    142 (longest request)

=== L3: 公网全链路 (https://106.53.100.198) ===

Requests per second:    6051.32 [#/sec] (mean)
  50%      2
  95%      5
  99%      7
 100%     79 (longest request)

=== L4: gateway 故障转移 (停 gateway-1，流量应切到 gateway-2) ===

  暂停 gateway-1...
http-rpc-gateway-1-1
  gateway-1 已暂停，发送 20 个请求（期望全部成功，走 gateway-2）
  失败请求: 6 / 20
  故障转移异常 (6 次失败)
  恢复 gateway-1...
http-rpc-gateway-1-1
  gateway-1 已恢复

=== L5: 稳定性测试 (30min 全时长, 8r + 2w 混合负载) ===
  预创建 100 条测试数据...